nsec/nsec-badge/nrf52/ssd1306.c
/*********************************************************************
This is a library for our Monochrome OLEDs based on SSD1306 drivers

  Pick one up today in the adafruit shop!
  ------> http://www.adafruit.com/category/63_98

These displays use SPI to communicate, 4 or 5 pins are required to
interface

Adafruit invests time and resources providing this open source code,
please support Adafruit and open-source hardware by purchasing
products from Adafruit!

Written by Limor Fried/Ladyada  for Adafruit Industries.
BSD license, check license.txt for more information
All text above, and the splash screen below must be included in any redistribution
*********************************************************************/

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include <app_error.h>
#include <app_util_platform.h>
#include <nrf_drv_spi.h>
#include <nrf52.h>
#include <nrf_error.h>
#include <nrf_gpio.h>
#include <nrf_delay.h>

#include "boards.h"
#include "images/font_bitmap.c"

#include "ssd1306.h"

#define pgm_read_byte(addr) (*(const unsigned char *)(addr))

static uint8_t gfx_rotation = 0;
uint8_t ssd1306_vccstate = SSD1306_SWITCHCAPVCC;

typedef enum {
    COMMAND = 0,
    DATA = 1,
} t_screen_mode;


/*
 * SPI stuff
 */
static nrf_drv_spi_t spi = NRF_DRV_SPI_INSTANCE(0);

static void spi_init() {
    nrf_drv_spi_config_t spi_config;

    spi_config.frequency = NRF_DRV_SPI_FREQ_1M;
    spi_config.sck_pin = OLED_CLK;
    spi_config.miso_pin = NRF_DRV_SPI_PIN_NOT_USED;
    spi_config.mosi_pin = OLED_DATA;
    spi_config.ss_pin = OLED_CS;
    spi_config.bit_order = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;
    spi_config.mode = NRF_DRV_SPI_MODE_0;
    spi_config.irq_priority = APP_IRQ_PRIORITY_LOW;
    spi_config.orc = 0xFF;

    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, NULL, NULL));
}

static void spi_master_tx(const uint8_t * p_tx_data, uint16_t len) {
    while(len > 0) {
        const uint8_t packet_len = MIN(len, UINT8_MAX);
        APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, p_tx_data, packet_len, NULL, 0));
        len -= packet_len;
        p_tx_data += packet_len;
    }
}

/*
 * SSD1306 stuff
 */

// the memory buffer for the LCD
static uint8_t buffer[SSD1306_LCDHEIGHT * SSD1306_LCDWIDTH / 8] = {0};

// the most basic function, set a single pixel
void ssd1306_drawPixel(int16_t x, int16_t y, uint16_t color) {
    if ((x < 0) || (x >= SSD1306_LCDWIDTH) || (y < 0) || (y >= SSD1306_LCDHEIGHT))
        return;

    // check rotation, move pixel around if necessary
    switch (gfx_rotation) {
        case 1:
            swap(x, y);
            x = SSD1306_LCDWIDTH - x - 1;
            break;
        case 2:
            x = SSD1306_LCDWIDTH - x - 1;
            y = SSD1306_LCDHEIGHT - y - 1;
            break;
        case 3:
            swap(x, y);
            y = SSD1306_LCDHEIGHT - y - 1;
            break;
    }

    // x is which column
    switch (color)
    {
        case SSD1306_WHITE:   buffer[x+ (y/8)*SSD1306_LCDWIDTH] |=  (1 << (y&7)); break;
        case SSD1306_BLACK:   buffer[x+ (y/8)*SSD1306_LCDWIDTH] &= ~(1 << (y&7)); break;
        case SSD1306_INVERSE: buffer[x+ (y/8)*SSD1306_LCDWIDTH] ^=  (1 << (y&7)); break;
    }
}

void ssd1306_init(void) {
    spi_init();

    nrf_gpio_cfg_output(OLED_RESET);
    nrf_gpio_cfg_output(OLED_DC_MODE);

    nrf_gpio_pin_write(OLED_DC_MODE, COMMAND);
    nrf_gpio_pin_write(OLED_RESET, 1);
    nrf_delay_ms(1);
    nrf_gpio_pin_write(OLED_RESET, 0);
    nrf_delay_ms(10);
    nrf_gpio_pin_write(OLED_RESET, 1);

    #if defined SSD1306_128_32
        // Init sequence for 128x32 OLED module
        ssd1306_command(SSD1306_DISPLAYOFF);                    // 0xAE
        ssd1306_command(SSD1306_SETDISPLAYCLOCKDIV);            // 0xD5
        ssd1306_command(0x80);                                  // the suggested ratio 0x80
        ssd1306_command(SSD1306_SETMULTIPLEX);                  // 0xA8
        ssd1306_command(0x1F);
        ssd1306_command(SSD1306_SETDISPLAYOFFSET);              // 0xD3
        ssd1306_command(0x0);                                   // no offset
        ssd1306_command(SSD1306_SETSTARTLINE | 0x0);            // line #0
        ssd1306_command(SSD1306_CHARGEPUMP);                    // 0x8D
        if (ssd1306_vccstate == SSD1306_EXTERNALVCC)
        { ssd1306_command(0x10); }
        else
        { ssd1306_command(0x14); }
        ssd1306_command(SSD1306_MEMORYMODE);                    // 0x20
        ssd1306_command(0x00);                                  // 0x0 act like ks0108
        ssd1306_command(SSD1306_SEGREMAP | 0x1);
        ssd1306_command(SSD1306_COMSCANDEC);
        ssd1306_command(SSD1306_SETCOMPINS);                    // 0xDA
        ssd1306_command(0x02);
        ssd1306_command(SSD1306_SETCONTRAST);                   // 0x81
        ssd1306_command(0x8F);
        ssd1306_command(SSD1306_SETPRECHARGE);                  // 0xd9
        if (ssd1306_vccstate == SSD1306_EXTERNALVCC)
        { ssd1306_command(0x22); }
        else
        { ssd1306_command(0xF1); }
        ssd1306_command(SSD1306_SETVCOMDETECT);                 // 0xDB
        ssd1306_command(0x40);
        ssd1306_command(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
        ssd1306_command(SSD1306_NORMALDISPLAY);                 // 0xA6
    #endif

    #if defined SSD1306_128_64
        // Init sequence for 128x64 OLED module
        ssd1306_command(SSD1306_DISPLAYOFF);                    // 0xAE
        ssd1306_command(SSD1306_SETDISPLAYCLOCKDIV);            // 0xD5
        ssd1306_command(0x80);                                  // the suggested ratio 0x80
        ssd1306_command(SSD1306_SETMULTIPLEX);                  // 0xA8
        ssd1306_command(0x3F);
        ssd1306_command(SSD1306_SETDISPLAYOFFSET);              // 0xD3
        ssd1306_command(0x0);                                   // no offset
        ssd1306_command(SSD1306_SETSTARTLINE | 0x0);            // line #0
        ssd1306_command(SSD1306_CHARGEPUMP);                    // 0x8D
        if (ssd1306_vccstate == SSD1306_EXTERNALVCC)
        { ssd1306_command(0x10); }
        else
        { ssd1306_command(0x14); }
        ssd1306_command(SSD1306_MEMORYMODE);                    // 0x20
        ssd1306_command(0x00);                                  // 0x0 act like ks0108
        ssd1306_command(SSD1306_SEGREMAP | 0x1);
        ssd1306_command(SSD1306_COMSCANDEC);
        ssd1306_command(SSD1306_SETCOMPINS);                    // 0xDA
        ssd1306_command(0x12);
        ssd1306_command(SSD1306_SETCONTRAST);                   // 0x81
        if (ssd1306_vccstate == SSD1306_EXTERNALVCC)
        { ssd1306_command(0x9F); }
        else
        { ssd1306_command(0xCF); }
        ssd1306_command(SSD1306_SETPRECHARGE);                  // 0xd9
        if (ssd1306_vccstate == SSD1306_EXTERNALVCC)
        { ssd1306_command(0x22); }
        else
        { ssd1306_command(0xF1); }
        ssd1306_command(SSD1306_SETVCOMDETECT);                 // 0xDB
        ssd1306_command(0x40);
        ssd1306_command(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
        ssd1306_command(SSD1306_NORMALDISPLAY);                 // 0xA6
    #endif

