nsec/nsec-badge/nrf52/ssd1306.c
  if(bSwap) {
    ssd1306_drawFastVLineInternal(x, y, w, color);
  } else {
    ssd1306_drawFastHLineInternal(x, y, w, color);
  }
}

void ssd1306_drawFastHLineInternal(int16_t x, int16_t y, int16_t w, uint16_t color) {
  // Do bounds/limit checks
  if(y < 0 || y >= SSD1306_LCDHEIGHT) { return; }

  // make sure we don't try to draw below 0
  if(x < 0) {
    w += x;
    x = 0;
  }

  // make sure we don't go off the edge of the display
  if( (x + w) > SSD1306_LCDWIDTH) {
    w = (SSD1306_LCDWIDTH - x);
  }

  // if our width is now negative, punt
  if(w <= 0) { return; }

  // set up the pointer for  movement through the buffer
  register uint8_t *pBuf = buffer;
  // adjust the buffer pointer for the current row
  pBuf += ((y/8) * SSD1306_LCDWIDTH);
  // and offset x columns in
  pBuf += x;

  register uint8_t mask = 1 << (y&7);

  switch (color)
  {
  case SSD1306_WHITE:         while(w--) { *pBuf++ |= mask; }; break;
    case SSD1306_BLACK: mask = ~mask;   while(w--) { *pBuf++ &= mask; }; break;
  case SSD1306_INVERSE:         while(w--) { *pBuf++ ^= mask; }; break;
  }
}

void ssd1306_drawFastVLine(int16_t x, int16_t y, int16_t h, uint16_t color) {
  bool bSwap = false;
  switch(gfx_rotation) {
    case 0:
      break;
    case 1:
      // 90 degree rotation, swap x & y for rotation, then invert x and adjust x for h (now to become w)
      bSwap = true;
      swap(x, y);
      x = SSD1306_LCDWIDTH - x - 1;
      x -= (h-1);
      break;
    case 2:
      // 180 degree rotation, invert x and y - then shift y around for height.
      x = SSD1306_LCDWIDTH - x - 1;
      y = SSD1306_LCDHEIGHT - y - 1;
      y -= (h-1);
      break;
    case 3:
      // 270 degree rotation, swap x & y for rotation, then invert y
      bSwap = true;
      swap(x, y);
      y = SSD1306_LCDHEIGHT - y - 1;
      break;
  }

  if(bSwap) {
    ssd1306_drawFastHLineInternal(x, y, h, color);
  } else {
    ssd1306_drawFastVLineInternal(x, y, h, color);
  }
}


void ssd1306_drawFastVLineInternal(int16_t x, int16_t __y, int16_t __h, uint16_t color) {

  // do nothing if we're off the left or right side of the screen
  if(x < 0 || x >= SSD1306_LCDWIDTH) { return; }

  // make sure we don't try to draw below 0
  if(__y < 0) {
    // __y is negative, this will subtract enough from __h to account for __y being 0
    __h += __y;
    __y = 0;

  }

  // make sure we don't go past the height of the display
  if( (__y + __h) > SSD1306_LCDHEIGHT) {
    __h = (SSD1306_LCDHEIGHT - __y);
  }

  // if our height is now negative, punt
  if(__h <= 0) {
    return;
  }

  // this display doesn't need ints for coordinates, use local byte registers for faster juggling
  register uint8_t y = __y;
  register uint8_t h = __h;


  // set up the pointer for fast movement through the buffer
  register uint8_t *pBuf = buffer;
  // adjust the buffer pointer for the current row
  pBuf += ((y/8) * SSD1306_LCDWIDTH);
  // and offset x columns in
  pBuf += x;

  // do the first partial byte, if necessary - this requires some masking
  register uint8_t mod = (y&7);
  if(mod) {
    // mask off the high n bits we want to set
    mod = 8-mod;

    // note - lookup table results in a nearly 10% performance improvement in fill* functions
    // register uint8_t mask = ~(0xFF >> (mod));
    static uint8_t premask[8] = {0x00, 0x80, 0xC0, 0xE0, 0xF0, 0xF8, 0xFC, 0xFE };
    register uint8_t mask = premask[mod];

    // adjust the mask if we're not going to reach the end of this byte
    if( h < mod) {
      mask &= (0XFF >> (mod-h));
    }

  switch (color)
    {
    case SSD1306_WHITE:   *pBuf |=  mask;  break;
    case SSD1306_BLACK:   *pBuf &= ~mask;  break;
    case SSD1306_INVERSE: *pBuf ^=  mask;  break;
    }

    // fast exit if we're done here!
    if(h<mod) { return; }

    h -= mod;

    pBuf += SSD1306_LCDWIDTH;
  }


  // write solid bytes while we can - effectively doing 8 rows at a time
  if(h >= 8) {
    if (color == SSD1306_INVERSE)  {          // separate copy of the code so we don't impact performance of the black/white write version with an extra comparison per loop
      do  {
      *pBuf=~(*pBuf);

        // adjust the buffer forward 8 rows worth of data
        pBuf += SSD1306_LCDWIDTH;

        // adjust h & y (there's got to be a faster way for me to do this, but this should still help a fair bit for now)
        h -= 8;
      } while(h >= 8);
      }
    else {
      // store a local value to work with
      register uint8_t val = (color == SSD1306_WHITE) ? 255 : 0;

      do  {
        // write our value in
      *pBuf = val;

        // adjust the buffer forward 8 rows worth of data
        pBuf += SSD1306_LCDWIDTH;

        // adjust h & y (there's got to be a faster way for me to do this, but this should still help a fair bit for now)
        h -= 8;
      } while(h >= 8);
      }
    }

  // now do the final partial byte, if necessary
  if(h) {
    mod = h & 7;
    // this time we want to mask the low bits of the byte, vs the high bits we did above
    // register uint8_t mask = (1 << mod) - 1;
    // note - lookup table results in a nearly 10% performance improvement in fill* functions
    static uint8_t postmask[8] = {0x00, 0x01, 0x03, 0x07, 0x0F, 0x1F, 0x3F, 0x7F };
    register uint8_t mask = postmask[mod];
    switch (color)
    {
      case SSD1306_WHITE:   *pBuf |=  mask;  break;
      case SSD1306_BLACK:   *pBuf &= ~mask;  break;
      case SSD1306_INVERSE: *pBuf ^=  mask;  break;
    }
  }
}


static int16_t gfx_width = SSD1306_LCDWIDTH;
static int16_t gfx_height = SSD1306_LCDHEIGHT;
static int16_t gfx_cursor_y = 0;
static int16_t gfx_cursor_x = 0;
static uint8_t gfx_textsize = 1;
static uint16_t gfx_textcolor = 0xFFFF;
static uint16_t gfx_textbgcolor = 0xFFFF;
static bool gfx_wrap = true;

// Draw a circle outline
void gfx_drawCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color) {
  int16_t f = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x = 0;
  int16_t y = r;

  ssd1306_drawPixel(x0  , y0+r, color);
  ssd1306_drawPixel(x0  , y0-r, color);
  ssd1306_drawPixel(x0+r, y0  , color);
  ssd1306_drawPixel(x0-r, y0  , color);

  while (x<y) {
    if (f >= 0) {
      y--;
      ddF_y += 2;
      f += ddF_y;
    }
    x++;
    ddF_x += 2;
    f += ddF_x;

    ssd1306_drawPixel(x0 + x, y0 + y, color);
    ssd1306_drawPixel(x0 - x, y0 + y, color);
    ssd1306_drawPixel(x0 + x, y0 - y, color);
    ssd1306_drawPixel(x0 - x, y0 - y, color);
    ssd1306_drawPixel(x0 + y, y0 + x, color);
    ssd1306_drawPixel(x0 - y, y0 + x, color);
    ssd1306_drawPixel(x0 + y, y0 - x, color);
    ssd1306_drawPixel(x0 - y, y0 - x, color);
  }
}

void gfx_drawCircleHelper( int16_t x0, int16_t y0, int16_t r, uint8_t cornername, uint16_t color) {
  int16_t f     = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x     = 0;
  int16_t y     = r;

  while (x<y) {
    if (f >= 0) {
      y--;
      ddF_y += 2;
      f     += ddF_y;
    }
    x++;
    ddF_x += 2;
    f     += ddF_x;
    if (cornername & 0x4) {
      ssd1306_drawPixel(x0 + x, y0 + y, color);
      ssd1306_drawPixel(x0 + y, y0 + x, color);
    }
    if (cornername & 0x2) {
      ssd1306_drawPixel(x0 + x, y0 - y, color);
      ssd1306_drawPixel(x0 + y, y0 - x, color);
    }
    if (cornername & 0x8) {
      ssd1306_drawPixel(x0 - y, y0 + x, color);
      ssd1306_drawPixel(x0 - x, y0 + y, color);
    }
    if (cornername & 0x1) {
      ssd1306_drawPixel(x0 - y, y0 - x, color);
      ssd1306_drawPixel(x0 - x, y0 - y, color);
    }
  }
}

void gfx_fillCircle(int16_t x0, int16_t y0, int16_t r, uint16_t color) {
  gfx_drawFastVLine(x0, y0-r, 2*r+1, color);
  gfx_fillCircleHelper(x0, y0, r, 3, 0, color);
}

// Used to do circles and roundrects
void gfx_fillCircleHelper(int16_t x0, int16_t y0, int16_t r, uint8_t cornername, int16_t delta, uint16_t color) {
  int16_t f     = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x     = 0;
  int16_t y     = r;

  while (x<y) {
    if (f >= 0) {
      y--;
      ddF_y += 2;
      f     += ddF_y;
    }
    x++;
    ddF_x += 2;
    f     += ddF_x;

