nsec/nsec-badge/nrf52/ssd1306.c
  for(j=0; j<h; j++) {
    for(i=0; i<w; i++ ) {
      if(pgm_read_byte(bitmap + j * byteWidth + i / 8) & (1 << (i % 8))) {
        ssd1306_drawPixel(x+i, y+j, color);
      }
    }
  }
}

void gfx_write(uint8_t c) {
  if (c == '\n') {
    gfx_cursor_y += gfx_textsize*8;
    gfx_cursor_x  = 0;
  } else if (c == '\r') {
    // skip em
  } else {
    gfx_drawChar(gfx_cursor_x, gfx_cursor_y, c, gfx_textcolor, gfx_textbgcolor, gfx_textsize);
    gfx_cursor_x += gfx_textsize*6;
    if (gfx_wrap && (gfx_cursor_x > (gfx_width - gfx_textsize*6))) {
      gfx_cursor_y += gfx_textsize*8;
      gfx_cursor_x = 0;
    }
  }
}

// Draw a character
void gfx_drawChar(int16_t x, int16_t y, unsigned char c, uint16_t color, uint16_t bg, uint8_t size) {
  if((x >= gfx_width)            || // Clip right
     (y >= gfx_height)           || // Clip bottom
     ((x + 6 * size - 1) < 0) || // Clip left
     ((y + 8 * size - 1) < 0))   // Clip top
    return;

  for (int8_t i=0; i<6; i++ ) {
    uint8_t line;
    if (i == 5)
      line = 0x0;
    else
      line = pgm_read_byte(font_bitmap+(c*5)+i);
    for (int8_t j = 0; j<8; j++) {
      if (line & 0x1) {
        if (size == 1){ // default size
          ssd1306_drawPixel(x+i, y+j, color);
        }
        else {  // big size
          gfx_fillRect(x+(i*size), y+(j*size), size, size, color);
        }
      } else if (bg != color) {
        if (size == 1) // default size
          ssd1306_drawPixel(x+i, y+j, bg);
        else {  // big size
          gfx_fillRect(x+i*size, y+j*size, size, size, bg);
        }
      }
      line >>= 1;
    }
  }
}

void gfx_setCursor(int16_t x, int16_t y) {
    gfx_cursor_x = x;
    gfx_cursor_y = y;
}

void gfx_setTextSize(uint8_t s) {
    gfx_textsize = (s > 0) ? s : 1;
}

void gfx_setTextColor(uint16_t c) {
    // For 'transparent' background, we'll set the bg
    // to the same as fg instead of using a flag
    gfx_textcolor = gfx_textbgcolor = c;
}

void gfx_setTextBackgroundColor(uint16_t c, uint16_t b) {
    gfx_textcolor   = c;
    gfx_textbgcolor = b;
}

void gfx_setTextWrap(bool w) {
    gfx_wrap = w;
}

void gfx_putc(char c) {
    gfx_write((uint8_t)c);
}

void gfx_puts(char *s) {
    while (*s) {
        gfx_write((uint8_t)*s++);
    }
}

void gfx_update() {
    ssd1306_update();
}
